app/Models/GsbModel.php

    public function get_infos_utilisateur($login, $mdp)
    {
        return $this->db->table('utilisateur')
            ->select('idutilisateur, nom, prenom, login, role.libelle, idRole')
            ->join('role', 'utilisateur.idRole = role.id', 'inner')
            ->where('login', $login)
            ->where('mdp', $mdp)
            ->get()
            ->getRowArray();
---
SELECT `idutilisateur`, `nom`, `prenom`, `login`, `role`.`libelle`, `idRole`
FROM `utilisateur`
INNER JOIN `role` ON `utilisateur`.`idRole` = `role`.`id`
WHERE `login` = 'admin'
AND `mdp` = 'admin'

    public function get_les_mois_disponibles($idVisiteur)
    {
        return $this->db->table('fichefrais')
            ->select('CONCAT(annee,mois) AS "anneemois", annee, mois')
            ->where('idVisiteur', $idVisiteur)
            ->orderBy('annee', 'DESC')
            ->orderBy('mois', 'DESC')
            ->get()
            ->getResultArray();
---
SELECT CONCAT(annee, mois) AS "anneemois", `annee`, `mois`
FROM `fichefrais`
WHERE `idVisiteur` = 'a17'
ORDER BY `annee` DESC, `mois` DESC

    public function get_id_ficheFrais($idVisiteur, $annee, $mois)
    {
        return $this->db->table('fichefrais')
            ->select('fichefrais.idFiche, fichefrais.idEtat')
            ->where('fichefrais.idVisiteur', $idVisiteur)
            ->where('fichefrais.annee', $annee)
            ->where('fichefrais.mois', $mois)
            ->get()
            ->getRowArray();
---
SELECT `fichefrais`.`idFiche`, `fichefrais`.`idEtat`
FROM `fichefrais`
WHERE `fichefrais`.`idVisiteur` = 'a17'
AND `fichefrais`.`annee` = '2025'
AND `fichefrais`.`mois` = '11'

    public function get_les_infos_ficheFrais($idFiche)
    {
        return $this->db->table('fichefrais')
            ->select('fichefrais.idFiche, fichefrais.idEtat, fichefrais.dateModif, fichefrais.nbJustificatifs, fichefrais.montantValide, etatfrais.libelle')
            ->join('etatfrais', 'fichefrais.idEtat = etatfrais.idetat')
            ->where('fichefrais.idFiche', $idFiche)
            ->get()
            ->getRowArray();
---
SELECT `fichefrais`.`idFiche`, `fichefrais`.`idEtat`, `fichefrais`.`dateModif`, `fichefrais`.`nbJustificatifs`, `fichefrais`.`montantValide`, `etatfrais`.`libelle`
FROM `fichefrais`
JOIN `etatfrais` ON `fichefrais`.`idEtat` = `etatfrais`.`idetat`
WHERE `fichefrais`.`idFiche` = '569'

    public function get_les_frais_forfait($idFiche)
    {
        return $this->db->table('lignefraisforfait')
            ->select('fraisforfait.idfraisforfait, fraisforfait.libelle, lignefraisforfait.quantite')
            ->join('fraisforfait', 'fraisforfait.idfraisforfait = lignefraisforfait.idFraisForfait')
            ->where('lignefraisforfait.idFiche', $idFiche)
            ->orderBy('lignefraisforfait.idFraisForfait', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT `fraisforfait`.`idfraisforfait`, `fraisforfait`.`libelle`, `lignefraisforfait`.`quantite`
FROM `lignefraisforfait`
JOIN `fraisforfait` ON `fraisforfait`.`idfraisforfait` = `lignefraisforfait`.`idFraisForfait`
WHERE `lignefraisforfait`.`idFiche` = '569'
ORDER BY `lignefraisforfait`.`idFraisForfait` ASC

    public function get_les_frais_hors_forfait($idFiche)
    {
        return $this->db->table('lignefraishorsforfait')
            ->where('idFiche', $idFiche)
            ->get()
            ->getResultArray();
---
SELECT *
FROM `lignefraishorsforfait`
WHERE `idFiche` = '569'

    public function est_premier_frais_mois($idVisiteur, $annee, $mois)
    {
        $row = $this->db->table('fichefrais')
            ->select('count(*) AS nblignesfrais')
            ->where('idVisiteur', $idVisiteur)
            ->where('annee', $annee)
            ->where('mois', $mois)
            ->get()
            ->getRowArray();
---
SELECT count(*) AS nblignesfrais
FROM `fichefrais`
WHERE `idVisiteur` = 'a17'
AND `annee` = '2025'
AND `mois` = '11'

    public function dernier_mois_saisi($idVisiteur)
    {
        $row = $this->db->table('fichefrais')
            ->select('max(CONCAT(annee,mois)) AS dernierAnneeMois')
            ->where('idVisiteur', $idVisiteur)
            ->get()
            ->getRowArray();
---
SELECT max(CONCAT(annee, mois)) AS dernierAnneeMois
FROM `fichefrais`
WHERE `idVisiteur` = 'a17'

    public function get_les_id_frais_forfait()
    {
        return $this->db->table('fraisforfait')
            ->select('idfraisforfait')
            ->orderBy('idfraisforfait')
            ->get()
            ->getResultArray();
---
SELECT `idfraisforfait`
FROM `fraisforfait`
ORDER BY `idfraisforfait`

    public function cree_nouvelles_lignes_frais($idVisiteur, $annee, $mois)
    {
        $dernierMois = $this->dernier_mois_saisi($idVisiteur);
        $gsb_lib = new Gsb_lib();
        $num_annee = $gsb_lib->get_annee_from_anneemois($dernierMois);
        $num_mois = $gsb_lib->get_mois_from_anneemois($dernierMois);

        $laDerniereFiche = $this->get_id_ficheFrais($idVisiteur, $num_annee, $num_mois);

        if ($laDerniereFiche != null && $laDerniereFiche['idEtat'] == 'CR') {
            $idDerniereFiche = $laDerniereFiche['idFiche'];
            $this->maj_etat_fiche_frais($idDerniereFiche, 'CL');
        }

        $resultat = $this->db->table('fichefrais')->insert([
            'idVisiteur' => $idVisiteur,
            'annee' => $annee,
            'mois' => $mois,
            'nbJustificatifs' => 0,
            'montantValide' => 0,
            'dateModif' => date('Y-m-d'),
            'idEtat' => 'CR'
        ]);

        $insertionsOK = true;
        if ($resultat) {
            // On récupère l'id de la fiche qui vient d'être créée
            $nouvelleFiche = $this->get_id_ficheFrais($idVisiteur, $annee, $mois);
            $idNouvelleFiche = $nouvelleFiche['idFiche'];
            foreach ($this->get_les_id_frais_forfait() as $unIdFraisForfait) {
                $res = $this->db->table('lignefraisforfait')->insert([
                    'idFiche' => $idNouvelleFiche,
                    'idFraisForfait' => $unIdFraisForfait['idfraisforfait'],
                    'quantite' => 0
                ]);
---
INSERT INTO `fichefrais` (`idVisiteur`, `annee`, `mois`, `nbJustificatifs`, `montantValide`, `dateModif`, `idEtat`) VALUES ('a17', '2025', '11', 0, 0, '2025-11-06', 'CR')
INSERT INTO `lignefraisforfait` (`idFiche`, `idFraisForfait`, `quantite`) VALUES ('569', 'ETP', 0)

    public function maj_etat_fiche_frais($idFiche, $etat)
    {
        $this->db->table('fichefrais')->update(
            ['idEtat' => $etat, 'dateModif' => date('Y-m-d')],
            ['idFiche' => $idFiche]
        );
---
UPDATE `fichefrais` SET `idEtat` = 'CL', `dateModif` = '2025-11-06'
WHERE `idFiche` = '22'